latex_tikz.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-25 Sun 22:06 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LaTeX - Pgf/Tikz</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">LaTeX - Pgf/Tikz</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org58935c3">Introduction</a></li>
<li><a href="#org7e7b664">Installation</a></li>
<li><a href="#orgb733b99">Basic usage</a>
<ul>
<li><a href="#org928d3cc">Setting</a></li>
<li><a href="#org8fdb092">Style</a>
<ul>
<li><a href="#org817c9da">Create a new style</a></li>
<li><a href="#org196c2d4">Modify an existing style</a></li>
</ul>
</li>
<li><a href="#orgebe116a">Coordinate</a></li>
<li><a href="#org4378e93">List</a></li>
<li><a href="#orgdbb6ed1">Arrow</a></li>
<li><a href="#orgec05312">Draw</a>
<ul>
<li><a href="#org8790032">Line</a></li>
<li><a href="#org822c0a3">Curve</a></li>
<li><a href="#org1b7db0a">Grid</a></li>
<li><a href="#orgc099ef8">Arc</a></li>
<li><a href="#orgff22f65">Rectangle</a></li>
<li><a href="#orgf88aedd">Circle</a></li>
<li><a href="#org5bfdb2d">Ellipse</a></li>
<li><a href="#org253343c">Node</a>
<ul>
<li><a href="#org78b2559">Connecting nodes with</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2ff56cb">Refer to nodes outside current picture</a></li>
<li><a href="#org10c1c39">Mix tikz command with LaTeX</a></li>
</ul>
</li>
<li><a href="#orge377366">Libraries</a>
<ul>
<li><a href="#orga8fa365"><code>tikzcd</code> for commutative diagrams</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org58935c3" class="outline-2">
<h2 id="org58935c3">Introduction</h2>
<div class="outline-text-2" id="text-org58935c3">
<p>
<i>Pgf/tikz</i> is an excellent <i>LaTeX</i> package to plot high quality graphs. This post just summaries its basic usages.
</p>
</div>
</div>
<div id="outline-container-org7e7b664" class="outline-2">
<h2 id="org7e7b664">Installation</h2>
<div class="outline-text-2" id="text-org7e7b664">
<p>
Pgf/Tikz is a built-in package in the <a href="http://tug.org">texlive</a>. As long as texlive is ready, pgf/tikz is out-of-the-box.
</p>
</div>
</div>
<div id="outline-container-orgb733b99" class="outline-2">
<h2 id="orgb733b99">Basic usage</h2>
<div class="outline-text-2" id="text-orgb733b99">
</div>
<div id="outline-container-org928d3cc" class="outline-3">
<h3 id="org928d3cc">Setting</h3>
<div class="outline-text-3" id="text-org928d3cc">
<div class="org-src-container">
<pre class="src src-latex">\usepackage{tikz}
...
\tikz ...
\begin{tikzpicture}
...
\end{tikzpicture}
</pre>
</div>
</div>
</div>
<div id="outline-container-org8fdb092" class="outline-3">
<h3 id="org8fdb092">Style</h3>
<div class="outline-text-3" id="text-org8fdb092">
</div>
<div id="outline-container-org817c9da" class="outline-4">
<h4 id="org817c9da">Create a new style</h4>
<div class="outline-text-4" id="text-org817c9da">
<div class="org-src-container">
<pre class="src src-latex">\tikzstyle{newstylename}=[option1=value1, option2=value2, ...]
</pre>
</div>
<p>
For example, following <a href="https://www.overleaf.com/learn/latex/LaTeX_Graphics_using_TikZ%3A_A_Tutorial_for_Beginners_(Part_3)%E2%80%94Creating_Flowcharts">styles</a> can be defined for nodes in a flowchart.
</p>
<div class="org-src-container">
<pre class="src src-latex">\tikzstyle{startstop} = [rectangle, rounded corners, minimum width=3cm, minimum height=1cm, text centered, text width=5cm, draw=black, fill=red!30]
\tikzstyle{io} = [trapezium, trapezium left angle=70, trapezium right angle=110, minimum width=3cm, minimum height=1cm, text centered, text width=5cm, draw=black, fill=blue!30]
\tikzstyle{process} = [rectangle, minimum width=3cm, minimum height=1cm, text centered, text width=5cm, draw=black, fill=orange!30]
\tikzstyle{decision} = [diamond, minimum width=3cm, minimum height=1cm, text centered, text width=5cm, draw=black, fill=green!30]
\tikzstyle{arrow} = [thick, -&gt;, &gt;=stealth]
</pre>
</div>
</div>
</div>
<div id="outline-container-org196c2d4" class="outline-4">
<h4 id="org196c2d4">Modify an existing style</h4>
<div class="outline-text-4" id="text-org196c2d4">
<div class="org-src-container">
<pre class="src src-latex">\tikzstyle{existingstylename}+=[option1=value1, option2=value2, ...]
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgebe116a" class="outline-3">
<h3 id="orgebe116a">Coordinate</h3>
<div class="outline-text-3" id="text-orgebe116a">
<ul class="org-ul">
<li><code>(x, y)</code></li>
<li><code>(angle: radius)</code></li>
</ul>
</div>
</div>
<div id="outline-container-org4378e93" class="outline-3">
<h3 id="org4378e93">List</h3>
<div class="outline-text-3" id="text-org4378e93">
<div class="org-src-container">
<pre class="src src-latex">% step length = 1
{a, ..., b}
...
% step length = d
{a, a + d, ..., b}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdbb6ed1" class="outline-3">
<h3 id="orgdbb6ed1">Arrow</h3>
<div class="outline-text-3" id="text-orgdbb6ed1">
<ul class="org-ul">
<li>-</li>
<li>-&gt;</li>
<li>&lt;-</li>
<li>&lt;-&gt;</li>
<li>-&gt;&gt;</li>
</ul>
</div>
</div>
<div id="outline-container-orgec05312" class="outline-3">
<h3 id="orgec05312">Draw</h3>
<div class="outline-text-3" id="text-orgec05312">
</div>
<div id="outline-container-org8790032" class="outline-4">
<h4 id="org8790032">Line</h4>
<div class="outline-text-4" id="text-org8790032">
<div class="org-src-container">
<pre class="src src-latex">\draw (x1, y1) -- (x2, y2) -- (x3, y3) -- cycle
</pre>
</div>
</div>
</div>
<div id="outline-container-org822c0a3" class="outline-4">
<h4 id="org822c0a3">Curve</h4>
<div class="outline-text-4" id="text-org822c0a3">
<div class="org-src-container">
<pre class="src src-latex">\draw (x1, y1) .. controls (x2, y2) and (x3, y3) .. (x4, y4);
\draw (x1, y1) .. controls (x2, y2) .. (x3, y3);
</pre>
</div>
</div>
</div>
<div id="outline-container-org1b7db0a" class="outline-4">
<h4 id="org1b7db0a">Grid</h4>
<div class="outline-text-4" id="text-org1b7db0a">
<div class="org-src-container">
<pre class="src src-latex">\draw [step=s] (x1, y1) grid (x2, y2);
\draw [xstep=x_s, ystep=y_s] (x1, y1) grid (x2, y2);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc099ef8" class="outline-4">
<h4 id="orgc099ef8">Arc</h4>
<div class="outline-text-4" id="text-orgc099ef8">
<div class="org-src-container">
<pre class="src src-latex">\draw (x1, y1) arc (start_angle: end_angle: radius);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgff22f65" class="outline-4">
<h4 id="orgff22f65">Rectangle</h4>
<div class="outline-text-4" id="text-orgff22f65">
<div class="org-src-container">
<pre class="src src-latex">\draw (x1, y1) rectangle (x2, y2);
\fill [color] (x1, y1) rectangle (x2, y2);
\filldraw [fill=color1, draw=color2] (x1, y1) rectangle (x2, y2);
\shade [inner/top/left color=color1, outer/bottom/right color=color2] (x1, y1) rectangle (x2, y2);
\shadedraw [inner/top/left color=color1, outer/bottom/right color=color2, draw=color3] (x1, y1) rectangle (x2, y2);
\clip (x1, y1) rectangle (x2, y2);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf88aedd" class="outline-4">
<h4 id="orgf88aedd">Circle</h4>
<div class="outline-text-4" id="text-orgf88aedd">
<div class="org-src-container">
<pre class="src src-latex">\draw (x1, y1) circle (radius);
\fill [color] (x1, y1) circle (radius);
\filldraw [fill=color1, draw=color2] (x1, y1) circle (radius);
\shade [inner/top/left color=color1, outer/bottom/right color=color2] (x1, y1) circle (radius);
\shadedraw [inner/top/left color=color1, outer/bottom/right color=color2, draw=color3] (x1, y1) circle (radius);
\clip (x1, y1) circle (radius);
</pre>
</div>
</div>
</div>
<div id="outline-container-org5bfdb2d" class="outline-4">
<h4 id="org5bfdb2d">Ellipse</h4>
<div class="outline-text-4" id="text-org5bfdb2d">
<div class="org-src-container">
<pre class="src src-latex">\draw (x1, y1) ellipse (x_radius and y_radius);
\fill [color] (x1, y1) ellipse (x_radius and y_radius);
\filldraw [fill=color1, draw=color2] (x1, y1) ellipse (x_radius and y_radius);
\shade [inner/top/left color=color1, outer/bottom/right color=color2] (x1, y1) ellipse (x_radius and y_radius);
\shadedraw [inner/top/left color=color1, outer/bottom/right color=color2, draw=color3] (x1, y1) ellipse (x_radius and y_radius);
\clip (x1, y1) ellipse (x_radius and y_radius);
</pre>
</div>
</div>
</div>
<div id="outline-container-org253343c" class="outline-4">
<h4 id="org253343c">Node</h4>
<div class="outline-text-4" id="text-org253343c">
<div class="org-src-container">
<pre class="src src-latex">(x0, y0) node [anchor=north/south/east/west, shape=circle/rectangle/ellipse, draw=color1, fill=color2, label=angle:node_label_angle] (node_name) {node_label};
...
\node at (x0, y0) (node_name) {node_label};
</pre>
</div>
</div>
<div id="outline-container-org78b2559" class="outline-5">
<h5 id="org78b2559">Connecting nodes with</h5>
<div class="outline-text-5" id="text-org78b2559">
<ul class="org-ul">
<li>Lines</li>
</ul>
<div class="org-src-container">
<pre class="src src-latex">\draw [arrow] (node_name_A) to (node_name_B);
\draw (node_name_A) edge [arrow, color] (node_name_B);
</pre>
</div>
<ul class="org-ul">
<li>Curves</li>
</ul>
<div class="org-src-container">
<pre class="src src-latex">\draw [arrow] (node_name_A) to [bend left/right=30] (node_name_B);
\draw [arrow] (node_name_A) to [in=30, out=60] (node_name_B);
\draw (node_name_A) edge [arrow, color, in=30, out=60] (node_name_B);
\draw (node_name_A) edge [arrow, color, bend left/right=30] (node_name_B);
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org2ff56cb" class="outline-3">
<h3 id="org2ff56cb">Refer to nodes outside current picture</h3>
<div class="outline-text-3" id="text-org2ff56cb">
<div class="org-src-container">
<pre class="src src-latex">\tikzstyle{every picture}+=[remember picture]
...
\tikz[overlay]
\begin{tikzpicture}[overlay]
...
\end{tikzpicture}
</pre>
</div>
</div>
</div>
<div id="outline-container-org10c1c39" class="outline-3">
<h3 id="org10c1c39">Mix tikz command with LaTeX</h3>
<div class="outline-text-3" id="text-org10c1c39">
<div class="org-src-container">
<pre class="src src-latex">\tikz [baseline] ...
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge377366" class="outline-2">
<h2 id="orge377366">Libraries</h2>
<div class="outline-text-2" id="text-orge377366">
<p>
Besides the basic tikz package, there are some libraries for dedicated purpose.
</p>
</div>
<div id="outline-container-orga8fa365" class="outline-3">
<h3 id="orga8fa365"><code>tikzcd</code> for commutative diagrams</h3>
<div class="outline-text-3" id="text-orga8fa365">
<ul class="org-ul">
<li><p>
Load the package
</p>
<div class="org-src-container">
<pre class="src src-latex">% Method-1
\usepackage{tikz}
\usetikzlibrary{cd}

% Method-2
\usepackage{tikz-cd}
</pre>
</div></li>
<li>Usage
<ul class="org-ul">
<li><p>
Environment for a commutative diagram
</p>
<div class="org-src-container">
<pre class="src src-latex">\begin{tikzcd}[OPTIONS]
    CONTENTS
\end{tikzcd}
</pre>
</div>
<ul class="org-ul">
<li>The <code>CONTENTS</code> are structured in a matrix style, e.g., with <code>&amp;</code> and <code>\\</code> to separate columns and rows respectively.</li>
<li>Everything inside <code>{tikz}</code> is typeset in math mode.</li>
</ul></li>
<li><p>
Arrow
In fact, an arrow object can follow either its starting or ending node (matrix element). But in my opinion, it is intuitionally natural to create an arrow object following its starting node.
</p>
<div class="org-src-container">
<pre class="src src-latex">\arrow[OPTIONS]
\ar[OPTIONS]
</pre>
</div>
<p>
where <code>OPTIONS</code> is a comma-separated list of options to specify an arrow, e.g.,
</p>
<ul class="org-ul">
<li><i>direction</i>, consisting of a string of characters.
<ul class="org-ul">
<li><code>u</code> for up</li>
<li><code>d</code> for down</li>
<li><code>l</code> for left</li>
<li><code>r</code> for right</li>
</ul></li>
<li><i>label</i>, quoted string on an arrow.
<ul class="org-ul">
<li>An arrow can have an arbitrary number of labels, with common separated.</li>
<li>If a label string consists of commas, then the label string should be enclosed in a pair of curly braces.</li>
<li>Optionally label-specific options can follow a target label (without comma separated), e.g.,
<ul class="org-ul">
<li>A color option, e.g., <code>red</code>.</li>
<li>A location option, e.g., <code>near start</code>, <code>near end</code>.</li>
<li>An apostrophe (<code>'</code>) flips the label to the opposite side of the arrow.</li>
<li>A multiplicity of options should be separated with commas and enclosed in a pair of curly braces.</li>
</ul></li>
</ul></li>
<li><i>color</i></li>
<li><i>line type</i>, e.g., <code>dashed</code>, <code>dotted</code>, etc.</li>
<li><i>arrow type</i>, e.g., <code>leftarrow</code>, <code>rightarrow</code>, <code>leftrightarrow</code>, <code>Leftarrow</code>, <code>Rightarrow</code>, <code>Leftrightarrow</code>, etc.</li>
<li><i>Fine tuning</i>, e.g., <code>shift left=1ex</code>, <code>shift right=1ex</code>.</li>
<li><code>crossing over</code> for 3-dimensional diagrams.</li>
<li><code>marking</code> places a preceding label over the arrow.</li>
<li><code>description</code> places a preceding label over the arrow with background filled.</li>
</ul></li>
<li><p>
Global option
</p>
<div class="org-src-container">
<pre class="src src-latex">\tikzcdset{OPTIONS}
</pre>
</div>
<p>
The options in <code>OPTIONS</code> are usually defined in <code>every diagram</code>, <code>every cell</code>, <code>every arrow</code>, <code>every label</code>, etc. and reinitialized when the command above is called.
</p>
<ul class="org-ul">
<li><p>
<code>every diagram</code>
</p>
<div class="org-src-container">
<pre class="src src-latex">row sep=normal,
column sep=normal,
/tikz/baseline=0pt
</pre>
</div></li>
<li><p>
<code>every matrix</code>
</p>
<div class="org-src-container">
<pre class="src src-latex">/tikz/inner sep=0pt
</pre>
</div></li>
<li><p>
<code>every cell</code>
</p>
<div class="org-src-container">
<pre class="src src-latex">/tikz/shape=asymmetrical rectangle,
/tikz/inner xsep=1ex,
/tikz/inner ysep=0.85ex
</pre>
</div></li>
<li><p>
<code>every arrow</code>
</p>
<div class="org-src-container">
<pre class="src src-latex">/tikz/draw,
/tikz/line width=rule_thickness,
rightarrow
</pre>
</div></li>
<li><p>
<code>every label</code>
</p>
<div class="org-src-container">
<pre class="src src-latex">/tikz/auto,
/tikz/font=something,
/tikz/inner sep=0.5ex
</pre>
</div></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
